Tekla Open API Reference for Tekla Structures 2025
ComponentOptions Properties
The ComponentOptions type exposes the following members.
Properties
Name | Description
AssemblyLoosePartPositionPrefix
The assembly loose position prefix.
AssemblyLoosePartStartNumber
The assembly loose part number.
BoltEdgeDistanceFactor
The factor of bolt edge distance.
BoltEdgeDistanceReference
The bolt edge distance reference.
BoltSize
The bolt size.
BoltStandard
 The bolt standard.
FoldedPlateProfileName
The folded plate profile name.
LoosePartPositionPrefix
The loose part position prefix.
LoosePartStartNumber
The loose part start number.
PartMaterial
The part material.
PartWeldedToPrimaryPositionPrefix
The part welded to primary position prefix.
PartWeldedToPrimaryStartNumber
The part welded to primary start number.
PartWeldedToSecondaryPositionPrefix
The part welded to secondary position prefix.
PartWeldedToSecondaryStartNumber
The part welded to secondary start number.
PlateProfileName
The plate profile name.
Top
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace